app/views/produto_pedidos/_form.html.erb

    <%= f.label :nome %><br>
    <%= f.select :nome, options_from_collection_for_select(Produto.all, 'nome', 'nome') %>
---
SELECT "produtos".* FROM "produtos"