app/views/pedidos/show.html.erb

  <tbody>
    <% @pedido.produto_pedido.each do |produto_pedido| %>
---
SELECT "produto_pedidos".* FROM "produto_pedidos" WHERE "produto_pedidos"."pedido_id" = $1  [["pedido_id", 1]]