app/controllers/pedidos_controller.rb

  def index
    @pedidos = Pedido.all
---
SELECT "pedidos".* FROM "pedidos"

  def create
    @pedido = Pedido.new(pedido_params)

    respond_to do |format|
      if @pedido.save
---
INSERT INTO "pedidos" ("fornecedor_id", "status_pedido", "data_pedido", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["fornecedor_id", 1], ["status_pedido", "Em aberto"], ["data_pedido", "2019-07-22"], ["created_at", "2019-07-22 01:45:09.355932"], ["updated_at", "2019-07-22 01:45:09.355932"]]

  def alterar_status
    @pedido.status_pedido=params[:status]
    @pedido.save
---
UPDATE "pedidos" SET "status_pedido" = $1, "updated_at" = $2 WHERE "pedidos"."id" = $3  [["status_pedido", "Fechado"], ["updated_at", "2019-07-23 19:54:03.036086"], ["id", 2]]

  def destroy
    @pedido.destroy
---
DELETE FROM "pedidos" WHERE "pedidos"."id" = $1  [["id", 3]]

    def set_pedido
      @pedido = Pedido.find(params[:id])
---
SELECT  "pedidos".* FROM "pedidos" WHERE "pedidos"."id" = $1 LIMIT 1  [["id", 3]]