app/controllers/produto_pedidos_controller.rb

SELECT "produto_pedidos".* FROM "produto_pedidos"
---
  def index
    @produto_pedidos = ProdutoPedido.all

SELECT  "produtos".* FROM "produtos" WHERE "produtos"."nome" = $1 LIMIT 1  [["nome", "Headset Cloud Stinger"]]
INSERT INTO "produto_pedidos" ("nome", "quantidade", "pedido_id", "valor_unitario", "valor_total", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
UPDATE "pedidos" SET "quantidade_itens" = $1, "valor_pedido" = $2, "updated_at" = $3 WHERE "pedidos"."id" = $4  [["quantidade_itens", 1], ["valor_pedido", 129.0], ["updated_at", "2019-07-22 01:45:48.261067"], ["id", 1]]
---
  def create
    @produto_pedido = ProdutoPedido.new(produto_pedido_params)
    @produto_pedido.valor_unitario = Produto.find_by(nome: params[:produto_pedido][:nome]).preco
    @produto_pedido.valor_total = @produto_pedido.valor_unitario * Integer(params[:produto_pedido][:quantidade])

    respond_to do |format|
      if @produto_pedido.save

UPDATE "pedidos" SET "quantidade_itens" = $1, "valor_pedido" = $2, "updated_at" = $3 WHERE "pedidos"."id" = $4  [["quantidade_itens", 3], ["valor_pedido", 3624.0], ["updated_at", "2019-07-22 01:48:49.230209"], ["id", 2]]
DELETE FROM "produto_pedidos" WHERE "produto_pedidos"."id" = $1  [["id", 4]]
---
  def destroy
    @pedido.quantidade_itens -= @produto_pedido.quantidade
    @pedido.valor_pedido += @produto_pedido.valor_total
    @pedido.save
    @produto_pedido.destroy

SELECT  "pedidos".* FROM "pedidos" WHERE "pedidos"."id" = $1 LIMIT 1  [["id", 2]]
---
    def set_pedido
      @pedido = Pedido.find(params[:pedido_id])

SELECT  "produto_pedidos".* FROM "produto_pedidos" WHERE "produto_pedidos"."id" = $1 LIMIT 1  [["id", 4]]
---
    def set_produto_pedido
      @produto_pedido = ProdutoPedido.find(params[:id])