app/controllers/produtos_controller.rb

INSERT INTO "produtos" ("nome", "preco", "fornecedor_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["nome", "Headset Cloud Stinger"], ["preco", 129.0], ["fornecedor_id", 1], ["created_at", "2019-07-22 01:37:25.809348"], ["updated_at", "2019-07-22 01:37:25.809348"]]
---
  def create
    @produto = Produto.new(produto_params)

    respond_to do |format|
      if @produto.save

SELECT  "produtos".* FROM "produtos" WHERE "produtos"."id" = $1 LIMIT 1  [["id", 3]]
---
    def set_produto
      @produto = Produto.find(params[:id])